# Ultralytics YOLO 🚀, GPL-3.0 license

# Parameters
nc: 10  # number of classes
depth_multiple: 0.33  # scales module repeats
width_multiple: 0.50  # scales convolution channels

# ts-sam backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, SAM, []]  # 0-P1/2

# YOLOv8.0l head
head:
  - [[0, 1, 2], 1, Segment, [nc, 32, 256]]  # Detect(P3, P4, P5)
